In [1]:
import cx_Oracle
import pymysql
import pandas as pd

# 오라클

In [32]:
dsn = cx_Oracle.makedsn('localhost',1521,'xe')
oracle_conn = cx_Oracle.connect(user = 'icia',password = '1234', dsn = dsn)
sql_oracle = oracle_conn.cursor()

In [3]:
query = 'create table test3(id number(1), name varchar(5), constraint test114_pk primary key(id))'

In [ ]:
sql_oracle.execute(query)

In [5]:
query2 = 'select * from test3'

In [6]:
pd.read_sql(sql = query2, con = oracle_conn)

C:\Users\user\anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   ID   NAME
0   3  test3

In [10]:
query3 = "insert into test3(id, name) values(3, 'test3')"

In [11]:
sql_oracle.execute(query3)

In [7]:
oracle_conn.commit()
sql_oracle.close()
oracle_conn.close()

# mysql

In [33]:
conn = pymysql.connect(host = 'localhost', user = 'root', password = '1234', db = 'lol', charset = 'utf8')
sql_mysql = conn.cursor()

In [11]:
query2 = 'create table test_mysql2(id smallint, name varchar(5), primary key(id))'

In [12]:
sql_mysql.execute(query2)

0

In [13]:
query3 = 'insert into test_mysql2(id, name) values(3, "test3")'

In [14]:
sql_mysql.execute(query3)
result = sql_mysql.fetchall()
conn.commit()

In [19]:
query4 = 'select * from test_mysql2'

In [20]:
sql_mysql.execute(query4)
result = sql_mysql.fetchall()
#conn.close()
print(result)

((3, 'test4'),)

In [17]:
query = 'insert into test_mysql2(id, name) values(3, "test3") on duplicate key update id = 3, name = "test4"'

In [18]:
sql_mysql.execute(query)
result = sql_mysql.fetchall()
conn.commit()

In [2]:
import my_uts as mu

In [2]:
mu.db_open()

oracle open

In [3]:
query = 'select * from test3'

In [4]:
mu.oracle_execute(query)

C:\Users\user\anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   ID   NAME
0   3  test3
1   4  test4

In [5]:
query2 = "insert into test3(id, name) values(4, 'test4')"

In [6]:
mu.oracle_execute(query2)

ORA-00001: unique constraint (ICIA.TEST114_PK) violated

In [7]:
mu.oracle_close()

'oracle close'

In [7]:
conn = mu.connect_mysql('lol')

In [8]:
mu.mysql_execute('select * from test_mysql2', conn)

((3, 'test3'),)

In [9]:
mu.mysql_execute_dict('select * from test_mysql2', conn)

[{'id': 3, 'name': 'test3'}]

In [6]:
mu.mysql_execute('insert into test_mysql2(id, name) values(3, "test3") on duplicate key update id = 3, name = "test3"', conn)
conn.commit()
conn.close()

In [3]:
url = 'http://openapi.seoul.go.kr:8088/(인증키)/xml/tbLnOpendataRentV/1/5/'

In [4]:
df = mu.df_creater(url)

In [5]:
sel_c = ['SGG_NM','BJDONG_NM','LAND_GBN_NM','FLR_NO','CNTRCT_DE','RENT_GBN','RENT_AREA','RENT_GTN','RENT_FEE','BLDG_NM','BUILD_YEAR']

In [6]:
df2 = df[sel_c].copy()

In [7]:
df2.columns=['자치구명','법정동명','지번구분명','층수','계약일','전월세','면적','보증금','임대료','건물명','건축년도']

In [8]:
df2 = df2.astype({'층수':'float','계약일':'int','면적':'float','보증금':'int','임대료':'int'})

# Oracle create

In [9]:
query = """
CREATE TABLE housePrice(자치구명 varchar(50), 법정동명 varchar(50), 지번구분명 varchar(50),
층수 float(20),계약일 number(20), 전월세 varchar(20), 면적 float(20), 보증금 number(20), 임대료 number(20),
건물명 varchar(100), 건축년도 varchar(20))
"""

#oracle

In [10]:
mu.db_open()
mu.oracle_execute(query)

oracle open
ORA-00955: name is already used by an existing object

# Oracle select

In [11]:
query2 = 'select * from housePrice'

In [12]:
mu.oracle_execute(query2)

C:\Users\user\anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   자치구명 법정동명 지번구분명   층수       계약일 전월세     면적    보증금  임대료   건물명  건축년도
0  영등포구  도림동  None  0.0  20230308  전세  41.23  10000    0  None  1990

# Mysql create

In [13]:
query3 = """CREATE TABLE housePrice(자치구명 varchar(50), 법정동명 varchar(50), 지번구분명 varchar(50),
층수 float(20),계약일 int, 전월세 varchar(20), 면적 float(20), 보증금 int, 임대료 int,
건물명 varchar(100), 건축년도 varchar(20))"""

#mysql

In [30]:
conn = mu.connect_mysql('lol')
mu.mysql_execute(query3, conn)

()

# Insert

In [35]:
query4 = (
f'insert into housePrice(자치구명, 법정동명, 지번구분명, 층수, 계약일, 전월세, 면적, 보증금, 임대료, 건물명, 건축년도)'
f'values({repr(df2.자치구명.iloc[0])},{repr(df2.법정동명.iloc[0])},{repr(df2.지번구분명.iloc[0])},'
f'{df2.층수.iloc[0]},{df2.계약일.iloc[0]},{repr(df2.전월세.iloc[0])},{df2.면적.iloc[0]},{df2.보증금.iloc[0]},'
f'{df2.임대료.iloc[0]},{repr(df2.건물명.iloc[0])},{repr(df2.건축년도.iloc[0])})'
)

# Oracle Insert

In [36]:
mu.db_open()
mu.oracle_execute(query4)
mu.oracle_close()

oracle open

'oracle close'

In [41]:
mu.db_open()
mu.oracle_execute(query2)

oracle open

C:\Users\user\anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   자치구명 법정동명 지번구분명   층수       계약일 전월세     면적    보증금  임대료   건물명  건축년도
0  영등포구  도림동  None  0.0  20230308  전세  41.23  10000    0  None  1990

# Mysql Insert

In [39]:
conn=mu.connect_mysql('lol')
mu.mysql_execute(query4, conn)
conn.commit()
conn.close()

In [40]:
conn = mu.connect_mysql('lol')
query5 = 'select * from housePrice'
mu.mysql_execute(query5, conn)

(('영등포구', '도림동', '', 0.0, 20230308, '전세', 41.23, 10000, 0, '', '1990'),)

# insert문을 함수로 정의

# conda install tqdm

In [43]:
from tqdm import tqdm

In [44]:
conn = mu.connect_mysql('lol')
for i in tqdm(range(len(df2))):
    query4 = (
    f'insert into housePrice(자치구명, 법정동명, 지번구분명, 층수, 계약일, 전월세, 면적, 보증금, 임대료, 건물명, 건축년도)'
    f'values({repr(df2.자치구명.iloc[i])},{repr(df2.법정동명.iloc[i])},{repr(df2.지번구분명.iloc[i])},'
    f'{df2.층수.iloc[i]},{df2.계약일.iloc[i]},{repr(df2.전월세.iloc[i])},{df2.면적.iloc[i]},{df2.보증금.iloc[i]},'
    f'{df2.임대료.iloc[i]},{repr(df2.건물명.iloc[i])},{repr(df2.건축년도.iloc[i])})'
    )
    mu.mysql_execute(query4,conn)
conn.commit()
conn.close()
#mysql

100%|████████████████████████████████████████████████████████████████████████████| 1000/1000 [00:00<00:00, 2562.24it/s]

In [42]:
mu.db_open()
for i in range(len(df2)):
    query4 = (
    f'insert into housePrice(자치구명, 법정동명, 지번구분명, 층수, 계약일, 전월세, 면적, 보증금, 임대료, 건물명, 건축년도)'
    f'values({repr(df2.자치구명.iloc[i])},{repr(df2.법정동명.iloc[i])},{repr(df2.지번구분명.iloc[i])},'
    f'{df2.층수.iloc[i]},{df2.계약일.iloc[i]},{repr(df2.전월세.iloc[i])},{df2.면적.iloc[i]},{df2.보증금.iloc[i]},'
    f'{df2.임대료.iloc[i]},{repr(df2.건물명.iloc[i])},{repr(df2.건축년도.iloc[i])})'
    )
    mu.oracle_execute(query4)
mu.oracle_close()

#oracle

oracle open

'oracle close'

In [45]:
conn = mu.connect_mysql('lol')
df3 = pd.DataFrame(mu.mysql_execute_dict(query5, conn))

In [46]:
df3

,자치구명,법정동명,지번구분명,층수,계약일,전월세,면적,보증금,임대료,건물명,건축년도
0,영등포구,도림동,,0.0,20230308,전세,41.23,10000,0,,1990
1,영등포구,도림동,,0.0,20230308,전세,41.23,10000,0,,1990
2,광진구,자양동,,0.0,20230308,월세,41.60,500,40,,1983
3,강동구,천호동,,0.0,20230308,월세,40.00,1000,60,,1996
4,동작구,사당동,,0.0,20230308,전세,36.22,13500,0,,1990
...,...,...,...,...,...,...,...,...,...,...,...
996,강남구,세곡동,대지,6.0,20230307,전세,84.98,43225,0,세곡리엔파크(4단지),2011
997,동작구,상도동,대지,9.0,20230307,월세,9.00,3000,43,그린시티,2018
998,구로구,구로동,대지,5.0,20230307,전세,21.96,8000,0,조성빌라,2000
999,은평구,갈현동,대지,1.0,20230307,전세,48.60,20000,0,가원,2001
1000,구로구,오류동,대지,11.0,20230307,전세,84.99,38000,0,우림필유,2005

In [48]:
def df_insert(df):
    mu.db_open()
    for i in range(len(df)):
        query4 = (
        f'insert into housePrice(자치구명, 법정동명, 지번구분명, 층수, 계약일, 전월세, 면적, 보증금, 임대료, 건물명, 건축년도)'
        f'values({repr(df.자치구명.iloc[i])},{repr(df.법정동명.iloc[i])},{repr(df.지번구분명.iloc[i])},'
        f'{df.층수.iloc[i]},{df.계약일.iloc[i]},{repr(df.전월세.iloc[i])},{df.면적.iloc[i]},{df.보증금.iloc[i]},'
        f'{df.임대료.iloc[i]},{repr(df.건물명.iloc[i])},{repr(df.건축년도.iloc[i])})'
        )
        mu.oracle_execute(query4)
    table = pd.DataFrame(mu.oracle_execute("select * from f'df'"))
    mu.oracle_close()
    return table

# 서울시 공공데이터포탈 - 서울시 코로나19 확진자 발생 동향


# api를 통해서 함수 정의했던 것으로 데이터 불러오기


# 컬럼명 - 서울시기준일, 서울시확진자, 서울시치료중, 서울시퇴원, 서울시사망, 전국확진, 전국사망

# DB에 테이블 생성 후 INSERT

# 테이블명 : Corona19CountStatus

In [49]:
table = mu.df_creater("http://openapi.seoul.go.kr:8088/(인증키)/xml/TbCorona19CountStatus/1/5/")

In [51]:
table.columns

Index(['S_DT', 'S_HJ', 'SN_HJ', 'S_CARE', 'S_RECOVER', 'SN_RECOVER', 'S_DEATH',
       'SY_TOTAL', 'SY_KJ', 'SY_KH', 'T_DT', 'T_HJ', 'N_HJ', 'TY_CARE',
       'RECOVER', 'DEATH', 'TY_TOTAL', 'TY_KJ', 'TY_KH', 'JGK_OVERSEAS_GS',
       'JGK_OVERSEAS_GH', 'JGK_CONT_GS', 'JGK_CONT_GH', 'CHECKING',
       'DAY_DEATH', 'ALL_DAY_DEATH'],
      dtype='object')

In [52]:
sel = ['S_DT', 'S_HJ', 'S_CARE', 'S_RECOVER', 'S_DEATH', 'T_HJ', 'DEATH']

In [53]:
table2 = table[sel].copy()

In [54]:
table2.columns = ['서울시기준일','서울시확진자','서울시치료중','서울시퇴원','서울시사망','전국확진','전국사망']

In [55]:
table2

            서울시기준일   서울시확진자 서울시치료중 서울시퇴원 서울시사망      전국확진   전국사망
0    2023.03.10.00  5944743      0        6359  30615522  34093
1    2023.03.09.00  5942573      0        6358  30605187  34081
2    2023.03.08.00  5940442      0        6358  30594297  34061
3    2023.03.07.00  5937995      0        6358  30581499  34049
4    2023.03.06.00  5935247      0        6355  30569215  34034
..             ...      ...    ...   ...   ...       ...    ...
995  2020.06.18.00     1170    446   718     6     12257    280
996  2020.06.17.00     1145    430   710     5     12198    279
997  2020.06.16.00     1132    425   703     4     12155    278
998  2020.06.15.00     1120    427   689     4     12121    277
999  2020.06.14.00     1113    420   689     4     12085    277

[1000 rows x 7 columns]

In [61]:
q = """CREATE TABLE Corona19CountStatus(서울시기준일 varchar(50), 서울시확진자 number(20), 서울시치료중 number(20),
서울시퇴원 varchar(20), 서울시사망 number(20), 전국확진 number(20), 전국사망 number(20))"""

In [62]:
mu.db_open()
mu.oracle_execute(q)

oracle open

'oracle query success'

In [69]:
mu.oracle_execute("select * from Corona19CountStatus")

C:\Users\user\anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

Empty DataFrame
Columns: [서울시기준일, 서울시확진자, 서울시치료중, 서울시퇴원, 서울시사망, 전국확진, 전국사망]
Index: []

In [78]:
def seoul_insert(df):
    mu.db_open()
    for i in range(len(df)):
        q2 = (
        f'insert into Corona19CountStatus(서울시기준일, 서울시확진자, 서울시치료중, 서울시퇴원, 서울시사망, 전국확진, 전국사망)'
        f'values({repr(df.서울시기준일.iloc[i])},{df.서울시확진자.iloc[i]},{df.서울시치료중.iloc[i]},'
        f'{repr(df.서울시퇴원.iloc[i])},{df.서울시사망.iloc[i]},{df.전국확진.iloc[i]},{df.전국사망.iloc[i]})'
        )
        mu.oracle_execute(q2)
    mu.oracle_close()
    return df

In [79]:
seoul_oracle = seoul_insert(table2)

oracle open

In [80]:
seoul_oracle

            서울시기준일   서울시확진자 서울시치료중 서울시퇴원 서울시사망      전국확진   전국사망
0    2023.03.10.00  5944743      0        6359  30615522  34093
1    2023.03.09.00  5942573      0        6358  30605187  34081
2    2023.03.08.00  5940442      0        6358  30594297  34061
3    2023.03.07.00  5937995      0        6358  30581499  34049
4    2023.03.06.00  5935247      0        6355  30569215  34034
..             ...      ...    ...   ...   ...       ...    ...
995  2020.06.18.00     1170    446   718     6     12257    280
996  2020.06.17.00     1145    430   710     5     12198    279
997  2020.06.16.00     1132    425   703     4     12155    278
998  2020.06.15.00     1120    427   689     4     12121    277
999  2020.06.14.00     1113    420   689     4     12085    277

[1000 rows x 7 columns]

In [81]:
q_sql = """CREATE TABLE Corona19CountStatus(서울시기준일 varchar(50), 서울시확진자 int, 서울시치료중 int,
서울시퇴원 varchar(20), 서울시사망 int, 전국확진 int, 전국사망 int)"""

In [82]:
conn = mu.connect_mysql('lol')
mu.mysql_execute(q_sql, conn)

()

In [83]:
conn.close()

In [88]:
def seoul_insert2(df):
    conn = mu.connect_mysql('lol')
    for i in range(len(df)):
        q2 = (
        f'insert into Corona19CountStatus(서울시기준일, 서울시확진자, 서울시치료중, 서울시퇴원, 서울시사망, 전국확진, 전국사망)'
        f'values({repr(df.서울시기준일.iloc[i])},{df.서울시확진자.iloc[i]},{df.서울시치료중.iloc[i]},'
        f'{repr(df.서울시퇴원.iloc[i])},{df.서울시사망.iloc[i]},{df.전국확진.iloc[i]},{df.전국사망.iloc[i]})'
        )
        mu.mysql_execute(q2,conn)
    conn.commit()
    conn.close()
    return df

In [89]:
seoul_sql = seoul_insert2(table2)

In [90]:
seoul_sql_frame = pd.DataFrame(seoul_sql)

In [91]:
seoul_sql_frame

            서울시기준일   서울시확진자 서울시치료중 서울시퇴원 서울시사망      전국확진   전국사망
0    2023.03.10.00  5944743      0        6359  30615522  34093
1    2023.03.09.00  5942573      0        6358  30605187  34081
2    2023.03.08.00  5940442      0        6358  30594297  34061
3    2023.03.07.00  5937995      0        6358  30581499  34049
4    2023.03.06.00  5935247      0        6355  30569215  34034
..             ...      ...    ...   ...   ...       ...    ...
995  2020.06.18.00     1170    446   718     6     12257    280
996  2020.06.17.00     1145    430   710     5     12198    279
997  2020.06.16.00     1132    425   703     4     12155    278
998  2020.06.15.00     1120    427   689     4     12121    277
999  2020.06.14.00     1113    420   689     4     12085    277

[1000 rows x 7 columns]

In [92]:
seoul_oracle_frmae = pd.DataFrame(seoul_oracle)

In [93]:
seoul_oracle_frmae

            서울시기준일   서울시확진자 서울시치료중 서울시퇴원 서울시사망      전국확진   전국사망
0    2023.03.10.00  5944743      0        6359  30615522  34093
1    2023.03.09.00  5942573      0        6358  30605187  34081
2    2023.03.08.00  5940442      0        6358  30594297  34061
3    2023.03.07.00  5937995      0        6358  30581499  34049
4    2023.03.06.00  5935247      0        6355  30569215  34034
..             ...      ...    ...   ...   ...       ...    ...
995  2020.06.18.00     1170    446   718     6     12257    280
996  2020.06.17.00     1145    430   710     5     12198    279
997  2020.06.16.00     1132    425   703     4     12155    278
998  2020.06.15.00     1120    427   689     4     12121    277
999  2020.06.14.00     1113    420   689     4     12085    277

[1000 rows x 7 columns]